# Create data and Basic operation

In [4]:
import pandas as pd

## Create DataFrame

### array

In [3]:
arr = [["Math",85], ["Chemistry",90], ["Chinese",40],["physics",40],["English",60]]

In [5]:
#create data 
pd.DataFrame(arr, columns = ["subject", "scores"])

     subject  scores
0       Math      85
1  Chemistry      90
2    Chinese      40
3    physics      40
4    English      60

###  dict

In [6]:
subjects,scores = ["Math", "Chemistry", "Chinese","physics","English"],[85, 90, 40, 40, 60]

In [7]:
data  = {
        "subjects": subjects,  
        "scores": scores
       }

In [8]:
pd.DataFrame(data)

    subjects  scores
0       Math      85
1  Chemistry      90
2    Chinese      40
3    physics      40
4    English      60

In [9]:
#choose columns ,also can modify order
pd.DataFrame(data,columns = ["subjects"])

    subjects
0       Math
1  Chemistry
2    Chinese
3    physics
4    English

In [10]:
pd.DataFrame(data,columns = ["scores","subjects"])

   scores   subjects
0      85       Math
1      90  Chemistry
2      40    Chinese
3      40    physics
4      60    English

### dictionary array

In [2]:
# input dictionary array
data = [{ 'Name':'James','Math': 85,'Chemistry': 90,'Chinese': 40,'physics':40,'English': 60},
        { 'Name':'Davis','Math': 90,'Chemistry': 70,'Chinese': 45,'physics': 30, 'English': 70},
        { 'Name':'Green','Math': 80,'Chemistry': 50,'Chinese': 40,'physics': 80, 'English': 50},
       ]

In [6]:
pd.DataFrame(data)

    Name  Math  Chemistry  Chinese  physics  English
0  James    85         90       40       40       60
1  Davis    90         70       45       30       70
2  Green    80         50       40       80       50

## Attributes

<ul>
    <li>shape</li>
    <li>describe()</li>  
    <li>columns</li>
    <li>index</li>
    <li>empty</li>
</ul>

In [5]:
# get Attributes
df = pd.DataFrame(data)

### shape

In [14]:
df.shape

(3, 6)

### describe()

In [15]:
df.describe()

       Math  Chemistry    Chinese    physics  English
count   3.0        3.0   3.000000   3.000000      3.0
mean   85.0       70.0  41.666667  50.000000     60.0
std     5.0       20.0   2.886751  26.457513     10.0
min    80.0       50.0  40.000000  30.000000     50.0
25%    82.5       60.0  40.000000  35.000000     55.0
50%    85.0       70.0  40.000000  40.000000     60.0
75%    87.5       80.0  42.500000  60.000000     65.0
max    90.0       90.0  45.000000  80.000000     70.0

### columns

In [16]:
df.columns

Index(['Name', 'Math', 'Chemistry', 'Chinese', 'physics', 'English'], dtype='object')

In [17]:
# get list of column
list(df.columns)

['Name', 'Math', 'Chemistry', 'Chinese', 'physics', 'English']

### index

In [19]:
df.index

RangeIndex(start=0, stop=3, step=1)

### empty

In [20]:
df.empty

False

## operation

### df.rename

In [8]:
df.rename(columns = {'Name':'First Name','English':"Sport"})

  First Name  Math  Chemistry  Chinese  physics  Sport
0      James    85         90       40       40     60
1      Davis    90         70       45       30     70
2      Green    80         50       40       80     50

也可以透過axis來指定修改col(axis = 1)或row(axis = 0)

In [10]:
df.rename({'Name':'First Name','English':"Sport"},axis=1)

  First Name  Math  Chemistry  Chinese  physics  Sport
0      James    85         90       40       40     60
1      Davis    90         70       45       30     70
2      Green    80         50       40       80     50

In [11]:
df.rename(index={0: "x", 1: "y", 2: "z"})

    Name  Math  Chemistry  Chinese  physics  English
x  James    85         90       40       40       60
y  Davis    90         70       45       30       70
z  Green    80         50       40       80       50

也可以使用 df.columns = [col_name]

In [14]:
df.columns = ['First Name','Math','Chemistry','Chinese','physics','Sport']

In [15]:
df

  First Name  Math  Chemistry  Chinese  physics  Sport
0      James    85         90       40       40     60
1      Davis    90         70       45       30     70
2      Green    80         50       40       80     50

### df.set_index

設定欄位當index

In [20]:
df.set_index(["First Name"])

            Math  Chemistry  Chinese  physics  Sport
First Name
James         85         90       40       40     60
Davis         90         70       45       30     70
Green         80         50       40       80     50

### df.sort_values

<a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html" rel="nofollow">詳細連結</a>

In [21]:
df.sort_values(by=['Chinese','Chemistry'])

  First Name  Math  Chemistry  Chinese  physics  Sport
2      Green    80         50       40       80     50
0      James    85         90       40       40     60
1      Davis    90         70       45       30     70

設定ascending為False,預設為True

In [23]:
df.sort_values(by=['Chinese','Chemistry'],ascending = False)

  First Name  Math  Chemistry  Chinese  physics  Sport
1      Davis    90         70       45       30     70
0      James    85         90       40       40     60
2      Green    80         50       40       80     50

In [24]:
df

  First Name  Math  Chemistry  Chinese  physics  Sport
0      James    85         90       40       40     60
1      Davis    90         70       45       30     70
2      Green    80         50       40       80     50

### df.fillna("")